app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.save # 保存失敗して
    if @book.id == nil
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "リーダブルコード"], ["body", "より良いコードを書くためのシンプルで実践的なテクニック"], ["created_at", "2020-07-05 01:43:08.168223"], ["updated_at", "2020-07-05 01:43:08.168223"]]
SELECT "books".* FROM "books"